{
	tips:[
"[JYD] Reason shapes the future, but superstition infects the present.",
"[JYD] Just because something does not have an ending doesn't mean it doesn't have a conclusion.",
"[JYD] We are what we do, not what we think.",
"[JYD] One should never mistake pattern … for meaning.",
"[JYD] I am what is known as an Unreliable Narrator, though of course if you believe everything you're told you deserve whatever you get.",
"[JYD] Sometimes what goes without saying is best said anyway.",
"[JYD] Time wastes itself. Who are we to float in its way?",
"[JYD] Very little matters very much and almost nothing matters greatly.",
"[JYD] One should never regret one's excesses, only one's failures of nerve.",
"[JYD] Really, read more Ian M. Banks.",
"[JYD] The bomb lives only as it is falling.",
"[JYD] All you ever were was a little bit of the universe, thinking to itself. Very specific; this bit, here, right now.",
"[JYD] A guilty system recognizes no innocents.",
"[JYD] Emergencies rarely occur when they’d be convenient.",
"[JYD] Money is a sign of poverty.",
"[JYD] Us with our busy, busy little lives, finding no better way to pass our years than in competitive disdain.",
"[JYD] Mocking the wisdom that comes with age is a fit sport only for those who expect never to attain much of it themselves",
"[JYD] Living either never has any point, or is always its own point; being a naturally cheery soul, I lean towards the latter.",
"[JYD] You can draw the blinds in a brothel, but people still know what you’re doing.",
"[JYD] Escape is a commodity like anything else.",
"[JYD] When in Rome; burn it.",
"[JYD] The better I do the worse things get because the more I have to lose.",
"[JYD] By the usual reckoning, the worst books make the best films.",
"[JYD] I do find birds interesting, don’t you?",
"[JYD] I just think people overvalue argument because they like to hear themselves talk.",
"[JYD] Empathize with stupidity and you’re halfway to thinking like an idiot,",
"[JYD] Hello there you bipedal, oxygen-breathing carboniform",
"[JYD] Always try to avoid setting up future opportunities for kicking yourself.",
    ],
}