{
	tips:[
     "[Gensoukyou Manufacture Historical Fragment Preservation Project]\n\nThe state may be old, Its fate lies in renewal.",
     "[Gensoukyou Manufacture Historical Fragment Preservation Project]\n\nRestore the lost knowledge of ancient sages, secure prospertiy for a thousand generations. ",
     "[Gensoukyou Manufacture Historical Fragment Preservation Project]\n\nEarth is the cradle of humanity, but humans won't live in the cradle forever.", # The earth is the cradle of mankind, but mankind cannot live in it forever
     "[Gensoukyou Manufacture Historical Fragment Preservation Project]\n\nThe vast prospects shown by space will undoubtedly bring tremendous rewards, but they will also come with enormous challenges and high costs.", # Surely the opening vistas of space promise high costs and hardships, as well as high reward. 
     "[Gensoukyou Manufacture Historical Fragment Preservation Project]\n\nSpace science, like nuclear science and all other technologies, are inherently devoid of morality.", # For space science, like nuclear science and all technology, has no conscience of its own. 
     "[Gensoukyou Manufacture Historical Fragment Preservation Project]\n\nHistory moves in contradictions.", # History moves in contradictions. 
     "[Gensoukyou Occult Guide]Rin • Pyou • Tou • Sha • Kai • Jin • Retsu • Zai • Zen",
     "[Gensoukyou Occult Guide]The Frog Croak from its mouth, which bringing upon the disaster of the snake.",
     "[Gensoukyou Occult Guide]Moses stretched out his rod to the sea, and the Lord used a strong east wind to make the sea dry land overnight, dividing the waters and turning the sea into dry ground.",
     "[Gensoukyou Occult Guide]The pen is mightier than the sword.", # The pen is mightier than the sword
     "[Gensoukyou Occult Guide]The nameless is the beginning of heaven and earth; the named is the mother of all things.",
     "[Gensoukyou Occult Guide]Believing in myth, then you shall record the stories like that of Hakutaku",
     "[Gensoukyou Occult Guide]The door is sealed within the promise of human redemption.",

     
     ],
     
     
     
}